driver-tests/bpelse/eventHandlers/onAlarm/src/onAlarmWithRepeatUntil/onAlarmWithRepeatUntilWSDL.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions targetNamespace="http://j2ee.netbeans.org/wsdl/onAlarmWithRepeatUntilWSDL"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/onAlarmWithRepeatUntilWSDL" name="onAlarmWithRepeatUntilWSDL" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types/>
    <message name="onAlarmWithRepeatUntilWSDLOperationRequest">
        <part name="part1" type="xsd:string"/>
    </message>
    <message name="onAlarmWithRepeatUntilWSDLOperationReply">
        <part name="part1" type="xsd:string"/>
    </message>
    <portType name="onAlarmWithRepeatUntilWSDLPortType">
        <wsdl:operation name="onAlarmWithRepeatUntilWSDLOperation">
            <wsdl:input name="input1" message="tns:onAlarmWithRepeatUntilWSDLOperationRequest"/>
            <wsdl:output name="output1" message="tns:onAlarmWithRepeatUntilWSDLOperationReply"/>
        </wsdl:operation>
    </portType>
    <binding name="onAlarmWithRepeatUntilWSDLBinding" type="tns:onAlarmWithRepeatUntilWSDLPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="onAlarmWithRepeatUntilWSDLOperation">
            <soap:operation/>
            <wsdl:input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/onAlarmWithRepeatUntilWSDL"/>
            </wsdl:input>
            <wsdl:output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/onAlarmWithRepeatUntilWSDL"/>
            </wsdl:output>
        </wsdl:operation>
    </binding>
    <service name="onAlarmWithRepeatUntilWSDLService">
        <wsdl:port name="onAlarmWithRepeatUntilWSDLPort" binding="tns:onAlarmWithRepeatUntilWSDLBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/onAlarmWithRepeatUntilWSDLService/onAlarmWithRepeatUntilWSDLPort"/>
        </wsdl:port>
    </service>
    <plnk:partnerLinkType name="onAlarmWithRepeatUntilWSDL1">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="onAlarmWithRepeatUntilWSDLPortTypeRole" portType="tns:onAlarmWithRepeatUntilWSDLPortType"/>
    </plnk:partnerLinkType>
</definitions>
