driver-tests/bpelse/eventHandlers/onAlarmJbi/test/onAlarmWithRepeatUntil/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:onal="http://j2ee.netbeans.org/wsdl/onAlarmWithRepeatUntilWSDL">
  <soapenv:Body>
    <onal:onAlarmWithRepeatUntilWSDLOperation>
      <part1>*Input for onAlarmWithRepeatUntil*</part1>
    </onal:onAlarmWithRepeatUntilWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>